module.ecs_service.data.aws_iam_policy_document.execution_assume_role: Reading...
module.ecs_service.data.aws_iam_policy_document.task_assume_role: Reading...
module.vpc.aws_cloudwatch_log_group.flow_logs: Refreshing state... [id=/aws/vpc/flow-logs]
module.vpc.aws_vpc.this: Refreshing state... [id=vpc-029a6cd1da94ed29e]
module.rds.aws_kms_key.rds_performance_insights: Refreshing state... [id=c7a90af2-b80a-47f5-817d-76ef08929a64]
module.vpc.aws_kms_key.vpc_flow_logs: Refreshing state... [id=347137e7-8489-4dd5-8ff0-561bac764438]
module.vpc.aws_iam_role.flow_logs_role: Refreshing state... [id=vpc-flow-logs-role]
module.ecs_service.data.aws_iam_policy_document.execution_assume_role: Read complete after 0s [id=1077804475]
module.ecs_service.data.aws_iam_policy_document.task_assume_role: Read complete after 0s [id=1077804475]
module.ecs_service.aws_iam_role.task_role: Refreshing state... [id=hello-birthday-api-service-task]
module.ecs_service.aws_iam_role.execution_role: Refreshing state... [id=hello-birthday-api-service-exec]
module.ecs_service.aws_ecs_task_definition.this: Refreshing state... [id=hello-birthday-api-service]
module.vpc.aws_iam_role_policy.flow_logs_policy: Refreshing state... [id=vpc-flow-logs-role:vpc-flow-logs-policy]
module.vpc.aws_cloudwatch_log_group.vpc_flow_logs: Refreshing state... [id=/aws/vpc/flowlogs/hello-birthday-dev]
module.vpc.aws_flow_log.vpc_flow_logs: Refreshing state... [id=fl-0f0309c1f8f7d983e]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-0b360bbebcaa480e5]
module.vpc.aws_route_table.private: Refreshing state... [id=rtb-01c87601e22172550]
module.vpc.aws_internet_gateway.this: Refreshing state... [id=igw-07832cfb87db1c4c3]
module.vpc.aws_security_group.rds: Refreshing state... [id=sg-0622864b918d283ed]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0ddb2b3fdf159574c]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0ca998b2f809f036c]
module.alb.aws_lb_target_group.this: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:456212641044:targetgroup/hello-birthday-api-tg/c3cc4acc965aafb5]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0b4f96a4a08eb4a5b]
module.vpc.aws_security_group.ecs: Refreshing state... [id=sg-0ae81af3f721e51a4]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0116a9ef8764923a8]
module.vpc.aws_route.default_internet_access: Refreshing state... [id=r-rtb-0b360bbebcaa480e51080289494]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-08047ccfb754ab73d]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0f88590ccfac5c504]
module.rds.aws_db_subnet_group.this: Refreshing state... [id=hello-birthday-dev-subnet-group]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0bc26398f249d5dad]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-000b959cb9c8c17b6]
module.alb.aws_lb.this: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:456212641044:loadbalancer/app/hello-birthday-api-alb/cc875576fdfa60e1]
module.rds.aws_db_instance.this: Refreshing state... [id=db-MNYKAUQQ3O3OCCMOP5A35SVKSM]
module.alb.aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:456212641044:listener/app/hello-birthday-api-alb/cc875576fdfa60e1/9da581d0f72d71a8]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.alb.aws_lb.this will be updated in-place
  ~ resource "aws_lb" "this" {
        id                                                           = "arn:aws:elasticloadbalancing:eu-west-1:456212641044:loadbalancer/app/hello-birthday-api-alb/cc875576fdfa60e1"
        name                                                         = "hello-birthday-api-alb"
      ~ security_groups                                              = [
          - "sg-050e63cf4332316a3",
        ]
        tags                                                         = {}
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.alb.aws_lb_listener.http will be updated in-place
  ~ resource "aws_lb_listener" "http" {
        id                                                                  = "arn:aws:elasticloadbalancing:eu-west-1:456212641044:listener/app/hello-birthday-api-alb/cc875576fdfa60e1/9da581d0f72d71a8"
        tags                                                                = {}
        # (17 unchanged attributes hidden)

      ~ default_action {
          ~ target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:456212641044:targetgroup/hello-birthday-api-tg/c3cc4acc965aafb5" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.alb.aws_lb_target_group.this must be replaced
-/+ resource "aws_lb_target_group" "this" {
      ~ arn                                = "arn:aws:elasticloadbalancing:eu-west-1:456212641044:targetgroup/hello-birthday-api-tg/c3cc4acc965aafb5" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/hello-birthday-api-tg/c3cc4acc965aafb5" -> (known after apply)
      + connection_termination             = (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:eu-west-1:456212641044:targetgroup/hello-birthday-api-tg/c3cc4acc965aafb5" -> (known after apply)
      ~ ip_address_type                    = "ipv4" -> (known after apply)
      ~ load_balancer_arns                 = [
          - "arn:aws:elasticloadbalancing:eu-west-1:456212641044:loadbalancer/app/hello-birthday-api-alb/cc875576fdfa60e1",
        ] -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
      ~ load_balancing_anomaly_mitigation  = "off" -> (known after apply)
      ~ load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> (known after apply)
        name                               = "hello-birthday-api-tg"
      + name_prefix                        = (known after apply)
      ~ port                               = 80 -> 5050 # forces replacement
      + preserve_client_ip                 = (known after apply)
      ~ protocol_version                   = "HTTP1" -> (known after apply)
      - tags                               = {} -> null
      ~ tags_all                           = {} -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ health_check (known after apply)
      - health_check {
          - enabled             = true -> null
          - healthy_threshold   = 5 -> null
          - interval            = 30 -> null
          - matcher             = "200" -> null
          - path                = "/" -> null
          - port                = "traffic-port" -> null
          - protocol            = "HTTP" -> null
          - timeout             = 5 -> null
          - unhealthy_threshold = 2 -> null
        }

      ~ stickiness (known after apply)
      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
            # (1 unchanged attribute hidden)
        }

      ~ target_failover (known after apply)
      - target_failover {}

      ~ target_group_health (known after apply)
      - target_group_health {
          - dns_failover {
              - minimum_healthy_targets_count      = "1" -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
          - unhealthy_state_routing {
              - minimum_healthy_targets_count      = 1 -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
        }

      ~ target_health_state (known after apply)
      - target_health_state {}
    }

  # module.ecs_cluster.aws_ecs_cluster.this will be created
  + resource "aws_ecs_cluster" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "cerepx-dev-cluster"
      + tags_all = (known after apply)

      + setting (known after apply)
    }

  # module.ecs_service.aws_ecs_service.this will be created
  + resource "aws_ecs_service" "this" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = "cerepx-dev-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "hello-birthday-api-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "hello-birthday-api"
          + container_port   = 5050
          + target_group_arn = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = [
              + "sg-0ae81af3f721e51a4",
            ]
          + subnets          = [
              + "subnet-0ca998b2f809f036c",
              + "subnet-0ddb2b3fdf159574c",
            ]
        }
    }

  # module.ecs_service.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:456212641044:task-definition/hello-birthday-api-service:1" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:456212641044:task-definition/hello-birthday-api-service" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - environment    = []
                  - essential      = true
                  - mountPoints    = []
                    name           = "hello-birthday-api"
                  ~ portMappings   = [
                      ~ {
                          ~ containerPort = 80 -> 5050
                          ~ hostPort      = 80 -> 5050
                            # (1 unchanged attribute hidden)
                        },
                    ]
                  - systemControls = []
                  - volumesFrom    = []
                    # (1 unchanged attribute hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "hello-birthday-api-service" -> (known after apply)
      ~ revision                 = 1 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.vpc.aws_security_group.ecs will be updated in-place
  ~ resource "aws_security_group" "ecs" {
        id                     = "sg-0ae81af3f721e51a4"
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.10.0.0/16",
                ]
              - description      = "HTTP from ALB"
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "10.10.0.0/16",
                ]
              + description      = "HTTP from ALB"
              + from_port        = 5050
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 5050
            },
        ]
        name                   = "hello-birthday-dev-ecs-sg"
        tags                   = {
            "Environment" = "dev"
            "Name"        = "hello-birthday-dev-ecs-sg"
        }
        # (8 unchanged attributes hidden)
    }

Plan: 4 to add, 3 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
Releasing state lock. This may take a few moments...

<!-- Sticky Pull Request Commentterraform-plan -->